Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyBadUnattachedVoids Property
 Family '[Family Name]' contains unattached voids that can't be combined for cutting. Try fixing the voids or unset the Cut with Voids parameter in the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyBadUnattachedVoids { get; }
Public Shared ReadOnly Property FamilyBadUnattachedVoids As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyBadUnattachedVoids {
	FailureDefinitionId^ get ();
}
static member FamilyBadUnattachedVoids : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace